SAFINAL/src/jbiServiceUnits/SAFINAL.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="SAFINAL"
             xmlns:tns="SAFINAL" xmlns:ns="http://j2ee.netbeans.org/wsdl/SA_TAREA/src/Ingreso" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/SA_TAREA/src/Ingreso" location="../jbiServiceUnits/SA_TAREA/Ingreso.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:IngresoPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="IngresoOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="SAFINAL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="SAFINAL"/>
            </output>
        </operation>
    </binding>
    <service name="SAFINALService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/SAFINALService1/casaPort1"/>
        </port>
    </service>
</definitions>
