SAFINAL/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:saf="SAFINAL">
  <soapenv:Body>
    <saf:IngresoOperation>
      <part1>C2</part1>
    </saf:IngresoOperation>
  </soapenv:Body>
</soapenv:Envelope>